In [41]:
import pandas as pd

In [42]:
pd.set_option('display.max_columns' , 85)
pd.set_option('display.max_rows' ,85)

In [43]:
people={
 'first' : ["ahmed","mohamed","kamal" , "ahmed"],
    'last': ["ali", "ibrahem" , "sayd", "mahmoud"],
    'age' : [23,13,45,34]
}

In [44]:
people

{'first': ['ahmed', 'mohamed', 'kamal', 'ahmed'],
 'last': ['ali', 'ibrahem', 'sayd', 'mahmoud'],
 'age': [23, 13, 45, 34]}

In [45]:
df = pd.DataFrame(people)

In [46]:
df

     first     last  age
0    ahmed      ali   23
1  mohamed  ibrahem   13
2    kamal     sayd   45
3    ahmed  mahmoud   34

In [47]:
df['full_name'] = df['first'] + " " + df['last']

In [48]:
df

     first     last  age        full_name
0    ahmed      ali   23        ahmed ali
1  mohamed  ibrahem   13  mohamed ibrahem
2    kamal     sayd   45       kamal sayd
3    ahmed  mahmoud   34    ahmed mahmoud

In [49]:
df['age_scale'] =  round(df['age'] / 100,2)

In [50]:
df

     first     last  age        full_name  age_scale
0    ahmed      ali   23        ahmed ali       0.23
1  mohamed  ibrahem   13  mohamed ibrahem       0.13
2    kamal     sayd   45       kamal sayd       0.45
3    ahmed  mahmoud   34    ahmed mahmoud       0.34

In [51]:
df.drop(columns=['age_scale','first','last'], inplace=True)

In [52]:
df

   age        full_name
0   23        ahmed ali
1   13  mohamed ibrahem
2   45       kamal sayd
3   34    ahmed mahmoud

In [53]:
 df[['first','last']] = df["full_name"].str.split(" ", expand= True)

In [54]:
df

   age        full_name    first     last
0   23        ahmed ali    ahmed      ali
1   13  mohamed ibrahem  mohamed  ibrahem
2   45       kamal sayd    kamal     sayd
3   34    ahmed mahmoud    ahmed  mahmoud

In [55]:
 df["full_name"].str.split(" ", expand= True)

         0        1
0    ahmed      ali
1  mohamed  ibrahem
2    kamal     sayd
3    ahmed  mahmoud

In [56]:
df

   age        full_name    first     last
0   23        ahmed ali    ahmed      ali
1   13  mohamed ibrahem  mohamed  ibrahem
2   45       kamal sayd    kamal     sayd
3   34    ahmed mahmoud    ahmed  mahmoud

In [57]:
df = pd.concat([df, pd.DataFrame([{"full_name":"mahmoud kamal"}])], ignore_index=True)

In [58]:
df

    age        full_name    first     last
0  23.0        ahmed ali    ahmed      ali
1  13.0  mohamed ibrahem  mohamed  ibrahem
2  45.0       kamal sayd    kamal     sayd
3  34.0    ahmed mahmoud    ahmed  mahmoud
4   NaN    mahmoud kamal      NaN      NaN

In [59]:
df.drop(index=4)

    age        full_name    first     last
0  23.0        ahmed ali    ahmed      ali
1  13.0  mohamed ibrahem  mohamed  ibrahem
2  45.0       kamal sayd    kamal     sayd
3  34.0    ahmed mahmoud    ahmed  mahmoud

In [62]:
filter = df['last'] == 'ali'
df[filter].index
df.drop(df[filter].index)

    age        full_name    first     last
1  13.0  mohamed ibrahem  mohamed  ibrahem
2  45.0       kamal sayd    kamal     sayd
3  34.0    ahmed mahmoud    ahmed  mahmoud
4   NaN    mahmoud kamal      NaN      NaN

In [63]:
df

    age        full_name    first     last
0  23.0        ahmed ali    ahmed      ali
1  13.0  mohamed ibrahem  mohamed  ibrahem
2  45.0       kamal sayd    kamal     sayd
3  34.0    ahmed mahmoud    ahmed  mahmoud
4   NaN    mahmoud kamal      NaN      NaN